; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v2 - type_1 ?v4 - type_3)
 	      (pred_1 ?v8 - object ?v4 - type_3)
	      (pred_2 ?v2 - type_1 ?v1 - type_2)
	      (pred_4 ?v2 - type_1 ?v8 - object ?v1 - type_2))

   (:action op_3
       :parameters  (?v2 - type_1 ?v7 ?v5 - type_3)
       :precondition (and  (pred_3 ?v2 ?v7))
       :effect (and  (pred_3 ?v2 ?v5)
		     (not (pred_3 ?v2 ?v7))))

   (:action op_2
       :parameters (?v2 - type_1 ?v6 - object ?v3 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v3) (pred_3 ?v2 ?v3) (pred_2 ?v2 ?v1))
       :effect (and (pred_4 ?v2 ?v6 ?v1)
		    (not (pred_1 ?v6 ?v3)) 
		    (not (pred_2 ?v2 ?v1))))

   (:action op_1
       :parameters (?v2 - type_1 ?v6 - object ?v3 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v6 ?v1) (pred_3 ?v2 ?v3))
       :effect (and (pred_1 ?v6 ?v3)
		    (pred_2 ?v2 ?v1)
		    (not (pred_4 ?v2 ?v6 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_06 obj_03 - type_1
obj_05 obj_13 obj_12 obj_01 - type_2
obj_04 obj_08 obj_02 obj_14 - type_3
obj_10 obj_09 obj_07 obj_11 - object)
(:init
(pred_3 obj_06 obj_04)
(pred_2 obj_06 obj_05)
(pred_2 obj_06 obj_13)
(pred_3 obj_03 obj_08)
(pred_2 obj_03 obj_12)
(pred_2 obj_03 obj_01)
(pred_1 obj_10 obj_08)
(pred_1 obj_09 obj_02)
(pred_1 obj_07 obj_02)
(pred_1 obj_11 obj_14)
)
(:goal
(and
(pred_1 obj_10 obj_04)
(pred_1 obj_09 obj_08)
(pred_1 obj_07 obj_14)
(pred_1 obj_11 obj_14)
)
)

(:constraints
  (always (not (pred_3 obj_06 obj_02)))
)
)

; plan
1. (op_2 obj_03 obj_10 obj_08 obj_01)
   deleted: (pred_1 obj_10 obj_08) (pred_2 obj_03 obj_01)
   added: (pred_4 obj_03 obj_10 obj_01)
   goals met: 1 of 4
2. (op_3 obj_06 obj_04 obj_14)
   deleted: (pred_3 obj_06 obj_04)
   added: (pred_3 obj_06 obj_14)
   goals met: 1 of 4
3. (op_3 obj_03 obj_08 obj_04)
   deleted: (pred_3 obj_03 obj_08)
   added: (pred_3 obj_03 obj_04)
   goals met: 1 of 4
4. (op_3 obj_06 obj_14 obj_08)
   deleted: (pred_3 obj_06 obj_14)
   added: (pred_3 obj_06 obj_08)
   goals met: 1 of 4
5. (op_1 obj_03 obj_10 obj_04 obj_01)
   deleted: (pred_4 obj_03 obj_10 obj_01)
   added: (pred_1 obj_10 obj_04) (pred_2 obj_03 obj_01)
   goals met: 2 of 4
6. (op_3 obj_06 obj_08 obj_14)
   deleted: (pred_3 obj_06 obj_08)
   added: (pred_3 obj_06 obj_14)
   goals met: 2 of 4
7. (op_3 obj_03 obj_04 obj_02)
   deleted: (pred_3 obj_03 obj_04)
   added: (pred_3 obj_03 obj_02)
   goals met: 2 of 4
8. (op_2 obj_03 obj_07 obj_02 obj_01)
   deleted: (pred_1 obj_07 obj_02) (pred_2 obj_03 obj_01)
   added: (pred_4 obj_03 obj_07 obj_01)
   goals met: 2 of 4
9. (op_2 obj_03 obj_09 obj_02 obj_12)
   deleted: (pred_1 obj_09 obj_02) (pred_2 obj_03 obj_12)
   added: (pred_4 obj_03 obj_09 obj_12)
   goals met: 2 of 4
10. (op_3 obj_03 obj_02 obj_14)
   deleted: (pred_3 obj_03 obj_02)
   added: (pred_3 obj_03 obj_14)
   goals met: 2 of 4
11. (op_1 obj_03 obj_07 obj_14 obj_01)
   deleted: (pred_4 obj_03 obj_07 obj_01)
   added: (pred_1 obj_07 obj_14) (pred_2 obj_03 obj_01)
   goals met: 3 of 4
12. (op_3 obj_03 obj_14 obj_08)
   deleted: (pred_3 obj_03 obj_14)
   added: (pred_3 obj_03 obj_08)
   goals met: 3 of 4
13. (op_1 obj_03 obj_09 obj_08 obj_12)
   deleted: (pred_4 obj_03 obj_09 obj_12)
   added: (pred_1 obj_09 obj_08) (pred_2 obj_03 obj_12)
   goals met: 4 of 4
